app/controllers/api/v1/request_vacations_controller.rb

SELECT "request_vacations".* FROM "request_vacations"
---
  def index
    if validate_api_key(params[:api_key])
      render status: 200, json: {request_vacations: RequestVacation.all.as_json}

SELECT  "request_vacations".* FROM "request_vacations" WHERE (id = 5)  ORDER BY "request_vacations"."id" ASC LIMIT 1
UPDATE "request_vacations" SET "approved" = ?, "updated_at" = ? WHERE "request_vacations"."id" = ?  [["approved", 1], ["updated_at", "2018-03-02 17:33:24.358482"], ["id", 5]]
---
  def update_request_vacation
    if validate_api_key(params[:api_key])
      request_vacation = RequestVacation.where("id = ?", params[:id_remote]).first
      unless RequestVacation.nil?
        request_vacation.update_attributes(
          approved: params[:approved]
        )