app/controllers/api/v1/users_controller.rb

  def login_user
    user = User.where("email = ?", params[:email]).first
---
SELECT  "users".* FROM "users" WHERE (email = 'employee1@example.com')  ORDER BY "users"."id" ASC LIMIT 1